convert language and fix mermaid in docusaurus
